Oddly, once I add a description -> I'm still receiving an error message:

```
  # prefect_workspace_role.example will be created
  + resource "prefect_workspace_role" "example" {
      + account_id  = (known after apply)
      + created     = (known after apply)
      + description = "test"
      + id          = (known after apply)
      + name        = "Custom Workspace Role"
      + scopes      = [
          + "manage_blocks",
          + "see_flows",
        ]
      + updated     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
prefect_workspace_role.example: Creating...
╷
│ Error: Error creating Workspace Role
│ 
│   with prefect_workspace_role.example,
│   on main.tf line 18, in resource "prefect_workspace_role" "example":
│   18: resource "prefect_workspace_role" "example" {
│ 
│ Could not create Workspace Role, unexpected error: status code 403 Forbidden, error={"exception_message":"'CUSTOM_WORKSPACE_ROLES' not enabled"}
```

but I can successfully create a custom role via the UI 🤔 